Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: One system is an exception to this: on the GNU system (and this includes GNU/Linux), the GNU C library is the only C library.
de: Ein System ist eine Ausnahme: in einem GNU-System (und dies schließt GNU/Linux ein) ist die GNU C-Bibliothek die einzige C-Bibliothek.

source: So the distribution terms of the GNU C library determine whether it is possible to compile a proprietary program for the GNU system.
de: Die Vertriebsbedingungen der GNU C-Bibliothek bestimmen, ob es möglich ist, ein proprietäres Programm für das GNU-System zu kompilieren.

source: There is no ethical reason to allow proprietary applications on the GNU system, but strategically it seems that disallowing them would do more to discourage use of the GNU system than to encourage development of free applications.
de: Es gibt keinen ethischen Grund, proprietäre Anwendungen auf einem GNU-System zu ermöglichen, aber strategisch gesehen scheint es, dass das Verbieten eher von der Nutzung des GNU-Systems abhält, als die Entwicklung freier Anwendungen zu fördern.

source: That is why using the Library GPL is a good strategy for the C library.
de: Deshalb ist die Verwendung der Library GPL eine gute Strategie für die C-Bibliothek.

source: For other libraries, the strategic decision needs to be considered on a case-by-case basis.
de: Für andere Bibliotheken muss die strategische Entscheidung individuell getroffen werden.

source: When a library does a special job that can help write certain kinds of programs, then releasing it under the GPL, limiting it to free programs only, is a way of helping other free software developers, giving them an advantage against proprietary software.
de: Wenn eine Bibliothek bei einer speziellen Aufgabe helfen kann, bestimmte Arten von Programmen zu schreiben und dann unter der GPL freizugeben ‑ auf lediglich freie Programme begrenzt ‑ ist das ein Weg, anderen Freie-Software-Entwicklern zu helfen und einen Vorteil gegenüber proprietäre Software zu geben.

source: Consider GNU Readline, a library that was developed to provide command-line editing for BASH.
de: Betrachten wir GNU Readline, eine Bibliothek, die entwickelt wurde, um für BASH die Befehlszeilenbearbeitung zu ermöglichen.

source: Readline is released under the ordinary GNU GPL, not the Library GPL. This probably does reduce the amount Readline is used, but that is no loss for us.
de: Readline wird unter der gewöhnlichen GNU GPL vertrieben, nicht unter der Library GPL. Das reduziert möglicherweise die Häufigkeit, mit der Readline benutzt wird, aber das ist kein Verlust für uns.

source: Meanwhile, at least one useful application has been made free software specifically so it could use Readline, and that is a real gain for the community.
de: Inzwischen wurde mindestens eine nützliche Anwendung ausdrücklich zu freier Software gemacht, damit sie Readline nutzen kann, und das ist ein echter Gewinn für die Gemeinschaft.

source: Proprietary software developers have the advantages money provides; free software developers need to make advantages for each other.
de: Entwickler proprietärer Software haben die Vorteile, die Geld ermöglicht; Entwickler freier Software müssen sich gegenseitig Vorteile für einander verschaffen.

source: I hope some day we will have a large collection of GPL-covered libraries that have no parallel available to proprietary software, providing useful modules to serve as building blocks in new free software, and adding up to a major advantage for further free software development.
de: Ich hoffe, wir haben eines Tages eine große Sammlung GPL-lizenzierter Bibliotheken, die keine Parallelen zu verfügbarer proprietärer Software bilden, nützliche Module liefern, die als Bausteine in neuer freier Software dienen und sich zu einem größeren Vorteil für die weitere Freie-Software-Entwicklung summieren.

source: They come from a vision and a plan, not from impulse.
de: Sie stammen aus einer Vision und einem Plan, nicht aus einem Impuls heraus.

source: For example, we developed the GNU C library because a Unix-like system needs a C library, BASH because a Unix-like system needs a shell, and GNU tar because a Unix-like system needs a tar program.
de: Beispielsweise wurde die C-Bibliothek entwickelt, weil ein unixartiges System eine C-Bibliothek braucht, BASH, weil ein unixoides System einen Befehlszeileninterpreter braucht, und GNU Tar, weil ein unixoides System ein Archivierungsprogramm braucht.

source: The same is true for my own programs—the GNU C compiler, GNU Emacs, GDB and GNU Make.
de: Gleiches gilt für die von mir geschriebenen Programme ‑ den GNU C-Compiler, GNU Emacs, GDB und GNU Make.

source: Some GNU programs were developed to cope with specific threats to our freedom.
de: Einige GNU-Programme wurden entwickelt, um bestimmte Bedrohungen unserer Freiheit zu bewältigen.

source: Thus, we developed gzip to replace the Compress program, which had been lost to the community because of the LZW patents.
de: So entwickelten wir GZIP, um das Komprimierungsprogramm zu ersetzen, das der Gemeinschaft wegen der Patente auf LZW-verloren gegangen war.

source: We found people to develop LessTif, and more recently started GNOME and Harmony, to address the problems caused by certain proprietary libraries (see below).
de: Wir fanden Menschen um LessTif zu entwickeln und begannen vor kurzem mit der Entwicklung von GNOME und Harmony, um die durch bestimmte proprietäre Bibliotheken verursachten Probleme anzugehen (siehe unten).

source: We are developing the GNU Privacy Guard to replace popular nonfree encryption software, because users should not have to choose between privacy and freedom.
de: Wir entwickelten den GNU Privacy Guard, um eine beliebte unfreie Verschlüsselungssoftware zu ersetzen, weil Benutzer nicht zwischen Privatsphäre und Freiheit sollten wählen müssen.

source: Of course, the people writing these programs became interested in the work, and many features were added to them by various people for the sake of their own needs and interests.
de: Die Personen, die diese Programme schrieben, interessierten sich natürlich für die Arbeit, und viele Funktionen wurden von verschiedenen Personen aufgrund eigener Anforderungen und Interessen hinzugefügt.

source: But that is not why the programs exist.
de: Doch darum existieren die Programme nicht.

source: Unexpected developments At the beginning of the GNU Project, I imagined that we would develop the whole GNU system, then release it as a whole.
de: Unerwartete Entwicklungen Zu Beginn des GNU-Projekts stellte ich mir vor, wir würden das gesamte GNU-System entwickeln und dann als Ganzes freigeben.

source: That is not how it happened.
de: So ist es nicht gekommen.

source: Since each component of the GNU system was implemented on a Unix system, each component could run on Unix systems long before a complete GNU system existed.
de: Da jede Komponente des GNU-Systems auf einem Unix-System umgesetzt wurde, konnte jede auf einem Unix-System ausgeführt werden, lange bevor ein komplettes GNU-System existierte.

source: Some of these programs became popular, and users began extending them and porting them—to the various incompatible versions of Unix, and sometimes to other systems as well.
de: Einige dieser Programme wurden populär und Benutzer begannen sie zu erweitern und zu portieren ‑ auf die verschiedenen inkompatiblen Versionen von Unix und manchmal auch auf andere Systeme.

source: The process made these programs much more powerful, and attracted both funds and contributors to the GNU Project.
de: Dieser Vorgang machte diese Programme sehr viel mächtiger und zog sowohl Gelder als auch Mitwirkende zum GNU-Projekt.

source: But it probably also delayed completion of a minimal working system by several years, as GNU developers' time was put into maintaining these ports and adding features to the existing components, rather than moving on to write one missing component after another.
de: Aber er verzögerte möglicherweise auch die Fertigstellung eines minimal funktionierenden Systems um mehrere Jahre, da GNU-Entwickler Zeit in die Betreuung dieser Schnittstellen und zusätzliche Funktionen zu bestehenden Komponenten aufbrachten, anstatt eine fehlende Komponente nach der anderen zu schreiben.

source: The GNU Hurd By 1990, the GNU system was almost complete; the only major missing component was the kernel.
de: GNU Hurd Um 1990 war das GNU-System fast fertig. Die einzige größere fehlende Komponente war der Betriebssystemkern.

source: We had decided to implement our kernel as a collection of server processes running on top of Mach.
de: Wir hatten beschlossen, unseren Systemkern als eine Sammlung von Serverprozessen zu implementieren, die auf dem Mach laufen.

source: Mach is a microkernel developed at Carnegie Mellon University and then at the University of Utah; the GNU Hurd is a collection of servers (i.e., a herd of GNUs) that run on top of Mach, and do the various jobs of the Unix kernel.
de: Mach ist ein an der Carnegie Mellon-Universität und dann an der Universität von Utah entwickelter Mikrokern. GNU HURD ist eine Sammlung von Servern (d. h. eine Herde GNUs), die auf dem Mach laufen und verschiedene Aufgaben des Unix-Betriebssystemkerns erledigen.

source: The start of development was delayed as we waited for Mach to be released as free software, as had been promised.
de: Der Beginn der Entwicklung wurde verzögert, da wir, wie versprochen wurde, auf die Freigabe von Mach als Freie Software warteten.

source: One reason for choosing this design was to avoid what seemed to be the hardest part of the job: debugging a kernel program without a source-level debugger to do it with.
de: Ein Grund für die Wahl dieses Designs war zu vermeiden, was, wie es schien, der schwierigste Teil der Aufgabe war: Ein Systemkernprogramm ohne einen Source-Level-Debugger zu debuggen [Diagnose auf Quelltextebene].

source: This part of the job had been done already, in Mach, and we expected to debug the Hurd servers as user programs, with GDB.
de: Dieser Teil der Aufgabe war bereits im Mach erledigt, und wir erwarteten die HURD-Server als Benutzerprogramme mit GDB zu debuggen.

source: But it took a long time to make that possible, and the multithreaded servers that send messages to each other have turned out to be very hard to debug.
de: Aber es brauchte lange Zeit, um dies zu ermöglichen und die Multithread-Server, die sich gegenseitig Nachrichten senden, sich als sehr schwierig zu debuggen erwiesen haben. Den HURD zum soliden Arbeiten zu bringen, zog sich über mehrere Jahre hin.

source: Making the Hurd work solidly has stretched on for many years.
de: Alix Der GNU-Betriebssystemkern sollte ursprünglich nicht HURD genannt werden.

source: Alix The GNU kernel was not originally supposed to be called the Hurd.
de: Sein ursprünglicher Name war Alix ‑ benannt nach der Frau, die damals mein Schatz war.

source: Its original name was Alix—named after the woman who was my sweetheart at the time.
de: Sie, eine Unix-Systemadministratorin, hatte darauf hingewiesen wie ihr Name in ein allgemeines Namensmuster für Unix-Systemversionen passen würde.

source: She, a Unix system administrator, had pointed out how her name would fit a common naming pattern for Unix system versions; as a joke, she told her friends, “Someone should name a kernel after me.” I said nothing, but decided to surprise her with a kernel named Alix.
de: Jemand sollte einen Systemkern nach mir benennen witzelte sie unter Freunden. Ich sagte nichts dazu, aber beschloss sie mit einem Systemkern namens Alix zu überraschen.

source: It did not stay that way.
de: Es blieb nicht dabei.

source: Michael (now Thomas) Bushnell, the main developer of the kernel, preferred the name Hurd, and redefined Alix to refer to a certain part of the kernel—the part that would trap system calls and handle them by sending messages to Hurd servers.
de: Michael Bushnell (heute Thomas Bushnell), der Hauptentwickler des Systemkerns, bevorzugte den Namen HURD und definierte Alix neu, um auf einen bestimmen Teil des Systemkerns zu verweisen ‑ den Teil, der Systemaufrufe abfangen und diese durch Senden von Nachrichten an die Hurd-Server behandeln würde.

source: Later, Alix and I broke up, and she changed her name; independently, the Hurd design was changed so that the C library would send messages directly to servers, and this made the Alix component disappear from the design.
de: Später trennten sich unsere Wege und Alix änderte ihren Nachnamen; unabhängig davon wurde das HURD-Design geändert, damit die C-Bibliothek Nachrichten direkt an die Server senden würde, und das ließ die Alix-Komponente aus dem Design verschwinden.

source: But before these things happened, a friend of hers came across the name Alix in the Hurd source code, and mentioned it to her.
de: Doch bevor diese Dinge passierten, stieß ein Freund von ihr auf den Namen Alix im HURD-Quellcode und erwähnte es ihr gegenüber.

source: So she did have the chance to find a kernel named after her.
de: Sie hatte also die Chance, einen nach ihr benannten Systemkern zu finden.

source: Linux and GNU/Linux The GNU Hurd is not suitable for production use, and we don't know if it ever will be.
de: Linux und GNU/Linux GNU Hurd ist nicht für den produktiven Einsatz geeignet und wir wissen nicht, ob es jemals so sein wird.

source: The capability-based design has problems that result directly from the flexibility of the design, and it is not clear whether solutions exist.
de: Das fähigkeitsbasierte Konzept hat Probleme, die sich direkt aus der Flexibilität des Konzepts ergeben und es ist nicht klar, ob Lösungen existieren.

source: Fortunately, another kernel is available.
de: Glücklicherweise ist ein anderer Betriebssystemkern verfügbar.

source: In 1991, Linus Torvalds developed a Unix-compatible kernel and called it Linux.
de: Im Jahr 1991 entwickelte Linus Torvalds einen Unix-kompatiblen Systemkern und nannte ihn Linux.

source: It was proprietary at first, but in 1992, he made it free software; combining Linux with the not-quite-complete GNU system resulted in a complete free operating system.
de: Es war zunächst proprietär, aber im Jahr 1992 machte er es zu Freie Software.

source: (Combining them was a substantial job in itself, of course.) It is due to Linux that we can actually run a version of the GNU system today.
de: Die Kombination von Linux mit dem noch nicht ganz fertigen GNU-System führte zu einem vollständig freien Betriebssystem (die Kombination war natürlich eine erhebliche Aufgabe an sich).

source: We call this system version GNU/Linux, to express its composition as a combination of the GNU system with Linux as the kernel.
de: Es ist Linux zu verdanken, dass wir heute tatsächlich eine Version des GNU-Systems verwenden können.

source: Please don't fall into the practice of calling the whole system “Linux”, since that means attributing our work to someone else.
de: Wir nennen diese Version des Systems GNU/Linux, um dessen Zusammensetzung als Kombination aus dem GNU-System mit Linux als Systemkern auszudrücken.

source: Please give us equal mention.
de: Bitte verfallen Sie nicht der Praxis, das Gesamtsystem „Linux“ zu nennen, da das fälschlicherweise unsere Arbeit auf jemand anderen zurückführt.

source: Challenges in our future We have proved our ability to develop a broad spectrum of free software.
de: Bitte geben Sie uns eine ebensolche Erwähnung.

source: This does not mean we are invincible and unstoppable.
de: Herausforderungen in der Zukunft Wir haben unsere Fähigkeit, ein breites Spektrum an freier Software zu entwickeln, bewiesen.

source: Several challenges make the future of free software uncertain; meeting them will require steadfast effort and endurance, sometimes lasting for years.
de: Das bedeutet nicht, wir seien unbesiegbar und unaufhaltsam. Verschiedene Herausforderungen machen die Zukunft von freier Software unsicher; sie zu erfüllen, erfordert unerschütterliche Anstrengungen und Durchhaltevermögen, manchmal für Jahre.

source: It will require the kind of determination that people display when they value their freedom and will not let anyone take it away.
de: Es ist die Art von Entschlossenheit erforderlich, die Menschen zeigen, wenn sie ihre Freiheit schätzen und sich von niemanden wegnehmen lassen.

source: The following four sections discuss these challenges.
de: Die folgenden vier Abschnitte erörtern diese Herausforderungen.

source: Secret hardware Hardware manufacturers increasingly tend to keep hardware specifications secret.
de: Geheime Hardware Hardwarehersteller tendieren zunehmend dazu, Hardwarespezifikationen geheim zu halten.

source: This makes it difficult to write free drivers so that Linux and XFree86 can support new hardware.
de: Das macht es schwierig, freie Treiber zu schreiben, damit Linux und XFree86 neue Hardware unterstützen können.

source: We have complete free systems today, but we will not have them tomorrow if we cannot support tomorrow's computers.
de: Wir haben heute vollständig freie Systeme, aber wir werden sie morgen nicht mehr haben, wenn wir die Rechner von morgen nicht unterstützen können.

source: There are two ways to cope with this problem.
de: Es gibt zwei Wege, um mit diesem Problem fertig zu werden.

source: Programmers can do reverse engineering to figure out how to support the hardware.
de: Die Programmierer können mit Reverse Engineering ‚Nachkonstruktion‘ herausfinden, wie man die Hardware unterstützen kann.

source: The rest of us can choose the hardware that is supported by free software; as our numbers increase, secrecy of specifications will become a self-defeating policy.
de: Der Rest von uns kann die Hardware wählen, die von freier Software unterstützt wird; bei steigender Nutzerzahl wird das Geheimhalten der Spezifikationen eine selbstzerstörerische Politik.

source: Reverse engineering is a big job; will we have programmers with sufficient determination to undertake it?
de: Reverse Engineering ist eine äußerst umfangreiche Aufgabe. Werden wir Programmierer mit ausreichender Entschlossenheit haben, dies zu übernehmen?

source: Yes—if we have built up a strong feeling that free software is a matter of principle, and nonfree drivers are intolerable.
de: Ja, wenn wir ein starkes Gefühl aufgebaut haben, dass freie Software eine Frage des Prinzips ist und unfreie Treiber unerträglich sind.

source: And will large numbers of us spend extra money, or even a little extra time, so we can use free drivers?
de: Und werden viele zusätzliches Geld spenden oder sogar ein wenig mehr Zeit, damit wir freie Treiber nutzen können?

source: Yes, if the determination to have freedom is widespread.
de: Ja, wenn die Entschlossenheit, Freiheit zu haben, weit verbreitet ist.

source: (2008 note: this issue extends to the BIOS as well.
de: (Anmerkung: Dieses Problem erstreckt sich auch auf das BIOS. Es gibt ein freies BIOS namens LibreBoot.

source: There is a free BIOS, LibreBoot (a distribution of coreboot); the problem is getting specs for machines so that LibreBoot can support them without nonfree “blobs”.)
de: Das Problem ist Spezifikationen für Rechner zu erhalten, damit LibreBoot sie ohne unfreie Binary Large Objects ‚BLOBs‘ unterstützen kann. Stand: 2008)

source: Nonfree libraries A nonfree library that runs on free operating systems acts as a trap for free software developers.
de: Unfreie Bibliotheken Eine unfreie Bibliothek, die auf einem freien Betriebssystem ausgeführt wird, verhält sich für Freie-Software-Entwickler wie ein Falle.

source: The library's attractive features are the bait; if you use the library, you fall into the trap, because your program cannot usefully be part of a free operating system.
de: Die attraktiven Funktionen der Bibliothek sind der Köder, und wenn man sie nutzt, schnappt die Falle zu, weil das Programm nicht nutzbringend Teil eines freien Betriebssystems sein kann (streng genommen könnte man das Programm einbinden, aber es würde mit fehlender Bibliothek unmöglich ausgeführt werden können).

source: (Strictly speaking, we could include your program, but it won't run with the library missing.) Even worse, if a program that uses the proprietary library becomes popular, it can lure other unsuspecting programmers into the trap.
de: Noch schlimmer ist, wenn ein Programm, das die proprietäre Bibliothek nutzt, immer beliebter wird und so andere ahnungslose Programmierer in die Falle lockt.

source: The first instance of this problem was the Motif toolkit, back in the 80s.
de: Der erste Fall dieses Problems war der Motif-Werkzeugsatz, damals in den 80ern.

source: Although there were as yet no free operating systems, it was clear what problem Motif would cause for them later on.
de: Obwohl es noch keine freien Betriebssysteme gab, war klar, welche Probleme Motif später verursachen würde.

source: The GNU Project responded in two ways: by asking individual free software projects to support the free X Toolkit widgets as well as Motif, and by asking for someone to write a free replacement for Motif.
de: Das GNU-Projekt reagierte auf zweierlei Weise: indem einzelne Freie-Software-Projekte gebeten wurden, die freien Steuerelemente des X-Werkzeugsatzes als auch Motif zu unterstützen und indem nach jemand gesucht wurde, einen freien Ersatz für Motif zu schreiben.

source: The job took many years; LessTif, developed by the Hungry Programmers, became powerful enough to support most Motif applications only in 1997.
de: Diese Aufgabe dauerte viele Jahre; LessTif, von ungarischen Programmierern entwickelt, unterstütze erst ab 1997 die meisten Motif-Anwendungen.

source: Between 1996 and 1998, another nonfree GUI toolkit library, called Qt, was used in a substantial collection of free software, the desktop KDE.
de: Zwischen 1996 und 1998 wurde eine andere Bibliothek namens Qt als unfreie grafische Benutzerschnittstelle ‚GUI‘ in einer umfangreichen Freie-Software-Sammlung, der KDE-Arbeitsumgebung, genutzt.

source: Free GNU/Linux systems were unable to use KDE, because we could not use the library.
de: Freie GNU/Linux-Systeme waren außerstande KDE zu verwenden, denn die Bibliothek konnte nicht genutzt werden.

source: However, some commercial distributors of GNU/Linux systems who were not strict about sticking with free software added KDE to their systems—producing a system with more capabilities, but less freedom.
de: Allerdings fügten einige kommerzielle Distributoren von GNU/Linux-Systemen, die nicht streng an freier Software festhielten, KDE ihren Systemen hinzu ‑ produzierten so ein System mit mehr Möglichkeiten, aber weniger Freiheit.

source: The KDE group was actively encouraging more programmers to use Qt, and millions of new “Linux users” had never been exposed to the idea that there was a problem in this.
de: Die KDE-Gruppe ermutigte aktiv mehr Programmierer Qt zu benutzen, und Millionen von neuen „Linux-Nutzern“ waren nie der Idee ausgesetzt worden, dass es damit ein Problem gab.

source: The situation appeared grim.
de: Die Situation war makaber.

source: The free software community responded to the problem in two ways: GNOME and Harmony.
de: Die Freie-Software-Gemeinschaft reagierte auf das Problem in zweierlei Weise: GNOME und Harmony.

source: GNOME, the GNU Network Object Model Environment, is GNU's desktop project.
de: GNOME, das GNU Network Object Model Environment, ist GNUs Projekt einer grafischen Benutzeroberflächen-Umgebung.

source: Started in 1997 by Miguel de Icaza, and developed with the support of Red Hat Software, GNOME set out to provide similar desktop facilities, but using free software exclusively.
de: 1997 von Miguel de Icaza gestartet und entwickelt mit der Unterstützung von Red Hat Software, machte sich GNOME auf den Weg, mit ausschließlich freier Software eine ähnliche Ausstattung der Arbeitsumgebung zu schaffen.
